/*
Navicat MySQL Data Transfer

Source Server         : mysql
Source Server Version : 50554
Source Host           : localhost:3306
Source Database       : second_hand

Target Server Type    : MYSQL
Target Server Version : 50554
File Encoding         : 65001

Date: 2019-05-04 20:31:27
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for db_order
-- ----------------------------
DROP TABLE IF EXISTS `db_order`;
CREATE TABLE `db_order` (
  `ID` varchar(255) NOT NULL,
  `productid` varchar(255) NOT NULL,
  `username` varchar(255) NOT NULL,
  `createtime` datetime NOT NULL,
  `address` varchar(255) NOT NULL,
  PRIMARY KEY (`ID`),
  KEY `productid` (`productid`),
  KEY `username` (`username`),
  CONSTRAINT `productid` FOREIGN KEY (`productid`) REFERENCES `db_product` (`ID`),
  CONSTRAINT `username` FOREIGN KEY (`username`) REFERENCES `db_user` (`username`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of db_order
-- ----------------------------
INSERT INTO `db_order` VALUES ('0001', '15563520959838a70de93-6ed4-4b9c-a7da-ca79f6dfb50a0001', 'admin', '2019-04-17 01:04:14', '天空之城');
INSERT INTO `db_order` VALUES ('0002', '15563633197220912e10d-0677-4cbb-b64b-10efef809b8e0001', 'admin', '2019-04-05 01:48:40', '天空之城');
INSERT INTO `db_order` VALUES ('46e6e607-8274-4023-8f98-2c1ef06bd56f1556818175603', '15563636108408431cdde-c9b8-4db1-b335-37e714aebd080001', 'admin', '2019-05-03 01:29:35', '天津市');
INSERT INTO `db_order` VALUES ('504ddde3-d9d3-4512-9998-9cc076de17621556818871749', '155636351885658ff3369-b05c-4508-828a-81920b9764750001', 'admin', '2019-05-03 01:41:11', '上海市');
INSERT INTO `db_order` VALUES ('94b6758b-2989-49bb-9858-d66143de906a1556897555007', '155663779610559ba7f4d-cd6e-48d6-a5bc-96e72a92d0640001', 'admin', '2019-05-03 23:32:35', '上海市');

-- ----------------------------
-- Table structure for db_product
-- ----------------------------
DROP TABLE IF EXISTS `db_product`;
CREATE TABLE `db_product` (
  `ID` varchar(255) NOT NULL,
  `userid` varchar(255) NOT NULL DEFAULT '',
  `goods` varchar(255) NOT NULL,
  `goodsdescription` varchar(255) NOT NULL,
  `price` float(10,2) NOT NULL,
  `priceunit` varchar(50) NOT NULL,
  `acondition` varchar(255) NOT NULL,
  `location` varchar(255) NOT NULL,
  `shelftime` datetime NOT NULL,
  `goodstype` varchar(50) NOT NULL,
  `goodspic` varchar(255) NOT NULL,
  `state` varchar(50) NOT NULL COMMENT '已卖出/未卖出',
  PRIMARY KEY (`ID`),
  KEY `userid` (`userid`),
  CONSTRAINT `userid` FOREIGN KEY (`userid`) REFERENCES `db_user` (`ID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of db_product
-- ----------------------------
INSERT INTO `db_product` VALUES ('15563520959838a70de93-6ed4-4b9c-a7da-ca79f6dfb50a0001', '0001', '红木椅子', '十年红木椅子，绝对珍品！', '1000000.00', '人民币', '五成新', '北京市', '2019-04-27 16:01:35', '木制家具', '155635209598200018a70de93-6ed4-4b9c-a7da-ca79f6dfb50a.png', '已卖出');
INSERT INTO `db_product` VALUES ('155636330526586985438-b60f-4765-8d96-003bf7fd19360001', '0001', '红木椅子', '好好好好好好好好好好', '100000.00', '人民币', '七成新', '北京市', '2019-04-27 19:08:25', '木制家具', '1556363305265000186985438-b60f-4765-8d96-003bf7fd1936.png', '未卖出');
INSERT INTO `db_product` VALUES ('15563633121969f22f283-167d-4785-92d8-8f1eed864b300001', '0001', '红木椅子', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:08:32', '食品', '155636331219600019f22f283-167d-4785-92d8-8f1eed864b30.png', '未卖出');
INSERT INTO `db_product` VALUES ('1556363316050564ee1b3-a1c0-4726-a048-b6d2367a675e0001', '0001', '红木椅子', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:08:36', '食品', '15563633160500001564ee1b3-a1c0-4726-a048-b6d2367a675e.png', '未卖出');
INSERT INTO `db_product` VALUES ('15563633197220912e10d-0677-4cbb-b64b-10efef809b8e0001', '0001', '红木椅子', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:08:39', '食品', '155636331969100010912e10d-0677-4cbb-b64b-10efef809b8e.png', '已卖出');
INSERT INTO `db_product` VALUES ('1556363426498972e2f38-f9a3-4923-8caf-79c186de6e7f0001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:10:26', '食品', '15563634264970001972e2f38-f9a3-4923-8caf-79c186de6e7f.png', '未卖出');
INSERT INTO `db_product` VALUES ('1556363431226dc42848b-6930-4539-b105-2eae38d362e90001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:10:31', '食品', '15563634312250001dc42848b-6930-4539-b105-2eae38d362e9.png', '未卖出');
INSERT INTO `db_product` VALUES ('1556363435938cf3aed60-c010-49fd-9457-3d4d535816ad0001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:10:35', '食品', '15563634359370001cf3aed60-c010-49fd-9457-3d4d535816ad.png', '未卖出');
INSERT INTO `db_product` VALUES ('1556363442505be4863bc-988f-49dc-97de-f712f5d58b950001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:10:42', '木制家具', '15563634424730001be4863bc-988f-49dc-97de-f712f5d58b95.png', '未卖出');
INSERT INTO `db_product` VALUES ('155636344891413932f7c-1af4-4faf-b2b5-8ccddb201d220001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:10:48', '木制家具', '1556363448913000113932f7c-1af4-4faf-b2b5-8ccddb201d22.png', '未卖出');
INSERT INTO `db_product` VALUES ('155636345341094a1a642-16da-48f8-847c-97fe27d2a7e60001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:10:53', '木制家具', '1556363453410000194a1a642-16da-48f8-847c-97fe27d2a7e6.png', '未卖出');
INSERT INTO `db_product` VALUES ('15563634624429ff83792-d4a4-4fcb-9ef8-276a0ca73d680001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:11:02', '木制家具', '155636346244200019ff83792-d4a4-4fcb-9ef8-276a0ca73d68.png', '未卖出');
INSERT INTO `db_product` VALUES ('15563634678232592f9b5-ecc2-43fc-a6aa-5aae4b5a22a40001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:11:07', '木制家具', '155636346779500012592f9b5-ecc2-43fc-a6aa-5aae4b5a22a4.png', '未卖出');
INSERT INTO `db_product` VALUES ('155636347382016f35d28-c37f-437e-a634-8b12015ad4e10001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:11:13', '电器', '1556363473819000116f35d28-c37f-437e-a634-8b12015ad4e1.png', '未卖出');
INSERT INTO `db_product` VALUES ('15563634783615b92810c-2e2e-4aac-95e6-a94bdea243050001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:11:18', '电器', '155636347836100015b92810c-2e2e-4aac-95e6-a94bdea24305.png', '未卖出');
INSERT INTO `db_product` VALUES ('15563634869809f31e897-ccb1-4803-a8d1-db44ca0da7240001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:11:26', '电器', '155636348697900019f31e897-ccb1-4803-a8d1-db44ca0da724.png', '未卖出');
INSERT INTO `db_product` VALUES ('1556363493372dd5fa2d6-e803-498d-9db4-addf6a85ad220001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:11:33', '电器', '15563634933430001dd5fa2d6-e803-498d-9db4-addf6a85ad22.png', '未卖出');
INSERT INTO `db_product` VALUES ('15563634997514a191d69-26df-4624-ab70-98df829e08610001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:11:39', '电器', '155636349975100014a191d69-26df-4624-ab70-98df829e0861.png', '未卖出');
INSERT INTO `db_product` VALUES ('15563635052544e4fd41f-256c-4b49-903b-6e50d2bf74640001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:11:45', '户外', '155636350525300014e4fd41f-256c-4b49-903b-6e50d2bf7464.png', '未卖出');
INSERT INTO `db_product` VALUES ('155636351247422c0efec-4116-4e42-a5d5-31aa1b0b4ad30001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:11:52', '户外', '1556363512473000122c0efec-4116-4e42-a5d5-31aa1b0b4ad3.png', '未卖出');
INSERT INTO `db_product` VALUES ('155636351885658ff3369-b05c-4508-828a-81920b9764750001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:11:58', '户外', '1556363518827000158ff3369-b05c-4508-828a-81920b976475.png', '已卖出');
INSERT INTO `db_product` VALUES ('15563635247777b5acf4d-d457-41d1-adcd-254a8e793aed0001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:12:04', '户外', '155636352477700017b5acf4d-d457-41d1-adcd-254a8e793aed.png', '未卖出');
INSERT INTO `db_product` VALUES ('15563635301060888a92f-e465-4269-a4da-1d29b3b3e2600001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:12:10', '户外', '155636353010500010888a92f-e465-4269-a4da-1d29b3b3e260.png', '未卖出');
INSERT INTO `db_product` VALUES ('1556363542293462e6d53-1555-4998-af56-986366f88b840001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:12:22', '自制', '15563635422920001462e6d53-1555-4998-af56-986366f88b84.png', '未卖出');
INSERT INTO `db_product` VALUES ('155636355100649efa20c-34d6-4f36-add9-b6151f80ad6f0001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:12:31', '自制', '1556363550987000149efa20c-34d6-4f36-add9-b6151f80ad6f.png', '未卖出');
INSERT INTO `db_product` VALUES ('1556363555662fdfd747c-da44-47f7-981e-d9c453ed5caa0001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:12:35', '自制', '15563635556610001fdfd747c-da44-47f7-981e-d9c453ed5caa.png', '未卖出');
INSERT INTO `db_product` VALUES ('1556363561828415012ff-081f-4e47-b938-4c2ef4d414ce0001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '广东省', '2019-04-27 19:12:41', '自制', '15563635618260001415012ff-081f-4e47-b938-4c2ef4d414ce.png', '未卖出');
INSERT INTO `db_product` VALUES ('155636356793791d378b9-3e1c-4c6f-81ce-9ec730648ce80001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '广东省', '2019-04-27 19:12:47', '自制', '1556363567937000191d378b9-3e1c-4c6f-81ce-9ec730648ce8.png', '未卖出');
INSERT INTO `db_product` VALUES ('15563635763078a8d32af-c9b7-4777-bce7-9bcfc217dd130001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '四川省', '2019-04-27 19:12:56', '自制', '155636357627600018a8d32af-c9b7-4777-bce7-9bcfc217dd13.png', '未卖出');
INSERT INTO `db_product` VALUES ('1556363583668a1d09c6c-2fa9-4d88-8d1c-0db2712ec4010001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '湖北省', '2019-04-27 19:13:03', '海外代购', '15563635836670001a1d09c6c-2fa9-4d88-8d1c-0db2712ec401.png', '未卖出');
INSERT INTO `db_product` VALUES ('15563636056354a14585b-adbf-4063-86b7-40a9ce979d020001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:13:25', '海外代购', '155636360563500014a14585b-adbf-4063-86b7-40a9ce979d02.png', '未卖出');
INSERT INTO `db_product` VALUES ('15563636108408431cdde-c9b8-4db1-b335-37e714aebd080001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:13:30', '海外代购', '155636361081000018431cdde-c9b8-4db1-b335-37e714aebd08.png', '已卖出');
INSERT INTO `db_product` VALUES ('15563636349821cfd129c-4fd4-46b7-9aa5-5e507b6f5aee0001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:13:54', '数码', '155636363495300011cfd129c-4fd4-46b7-9aa5-5e507b6f5aee.png', '未卖出');
INSERT INTO `db_product` VALUES ('1556363639939d21269f0-47d9-47f5-9a93-233d0ec0de810001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:13:59', '数码', '15563636399390001d21269f0-47d9-47f5-9a93-233d0ec0de81.png', '未卖出');
INSERT INTO `db_product` VALUES ('1556363658554e54915d5-7131-41e8-9ea9-800aa21ce5790001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '北京市', '2019-04-27 19:14:18', '数码', '15563636585540001e54915d5-7131-41e8-9ea9-800aa21ce579.png', '未卖出');
INSERT INTO `db_product` VALUES ('1556363664290f308b102-3e9e-4805-882d-13363f6f560d0001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '海南省', '2019-04-27 19:14:24', '数码', '15563636642900001f308b102-3e9e-4805-882d-13363f6f560d.png', '未卖出');
INSERT INTO `db_product` VALUES ('1556363670418ede7654f-a600-40a8-9c66-9503743b242b0001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '湖北省', '2019-04-27 19:14:30', '数码', '15563636704170001ede7654f-a600-40a8-9c66-9503743b242b.png', '未卖出');
INSERT INTO `db_product` VALUES ('15563636764829e9e4eb4-c64f-4757-b702-7758658a70750001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '河南省', '2019-04-27 19:14:36', '服装', '155636367644900019e9e4eb4-c64f-4757-b702-7758658a7075.png', '未卖出');
INSERT INTO `db_product` VALUES ('1556363684068589d3fcb-8da4-40e0-8282-86cc9166d3910001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '浙江省', '2019-04-27 19:14:44', '服装', '15563636840680001589d3fcb-8da4-40e0-8282-86cc9166d391.png', '未卖出');
INSERT INTO `db_product` VALUES ('1556363691694796436f0-e0ec-4da7-bbc7-64114f65fdc60001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '湖北省', '2019-04-27 19:14:51', '服装', '15563636916930001796436f0-e0ec-4da7-bbc7-64114f65fdc6.png', '未卖出');
INSERT INTO `db_product` VALUES ('1556363699949956de6d8-2289-429b-b561-ff5974fdc1a80001', '0001', '好东西', '好好好好好好好好好好', '100000.00', '人民币', '一成新', '湖南省', '2019-04-27 19:14:59', '服装', '15563636999480001956de6d8-2289-429b-b561-ff5974fdc1a8.png', '未卖出');
INSERT INTO `db_product` VALUES ('155659375781280f0361b-b429-4503-939a-caad535010280001', '0001', '111', '1111111111111111111', '1000.00', '人民币', '一成新', '北京市', '2019-04-30 11:09:17', '食品', '1556593757811000180f0361b-b429-4503-939a-caad53501028.png', '未卖出');
INSERT INTO `db_product` VALUES ('1556593766023eb21b7ea-df00-4b58-be7d-0986661dac0b0001', '0001', '123', '1111111111111111111', '1000.00', '人民币', '一成新', '北京市', '2019-04-30 11:09:26', '食品', '15565937660230001eb21b7ea-df00-4b58-be7d-0986661dac0b.png', '未卖出');
INSERT INTO `db_product` VALUES ('1556637553317faa4dfe2-25fd-442f-bd4a-362468dde3ad0001', '0001', 'aaa', '海外代购食品木制家具电器', '100.00', '人民币', '一成新', '北京市', '2019-04-30 23:19:13', '食品', '15566375533170001faa4dfe2-25fd-442f-bd4a-362468dde3ad.png', '未卖出');
INSERT INTO `db_product` VALUES ('15566377089342f473259-147c-49dd-b3d0-f4164ec9e7130001', '0001', 'aaa', '户外自制数码服装海外代购', '1000.00', '人民币', '四成新', '北京市', '2019-04-30 23:21:48', '木制家具', '155663770893400012f473259-147c-49dd-b3d0-f4164ec9e713.png', '未卖出');
INSERT INTO `db_product` VALUES ('1556637725939495a3343-db08-40f0-88e4-3f61ebc29fc60001', '0001', 'aaa', '户外自制数码服装海外代购', '1000.00', '人民币', '一成新', '北京市', '2019-04-30 23:22:05', '食品', '15566377259380001495a3343-db08-40f0-88e4-3f61ebc29fc6.png', '未卖出');
INSERT INTO `db_product` VALUES ('155663774306212f62e97-3f53-4d34-9fa6-943c816189ac0001', '0001', 'aaa', '户外自制数码服装海外代购', '1000.00', '人民币', '一成新', '广东省', '2019-04-30 23:22:23', '户外', '1556637743062000112f62e97-3f53-4d34-9fa6-943c816189ac.png', '未卖出');
INSERT INTO `db_product` VALUES ('155663775142497b96002-bbfd-46dd-8bdc-2747c22b34760001', '0001', 'aaa', '户外自制数码服装海外代购', '1000.00', '人民币', '五成新', '北京市', '2019-04-30 23:22:31', '自制', '1556637751423000197b96002-bbfd-46dd-8bdc-2747c22b3476.png', '未卖出');
INSERT INTO `db_product` VALUES ('155663779610559ba7f4d-cd6e-48d6-a5bc-96e72a92d0640001', '0001', 'aaa', '户外自制数码服装海外代购食品木制家具电器', '1000.00', '人民币', '一成新', '北京市', '2019-04-30 23:23:16', '海外代购', '1556637795839000159ba7f4d-cd6e-48d6-a5bc-96e72a92d064.png', '已卖出');
INSERT INTO `db_product` VALUES ('1556637802680e1cd927b-450c-4856-96d8-519b682618e60001', '0001', 'aaa', '户外自制数码服装海外代购食品木制家具电器', '1000.00', '人民币', '一成新', '北京市', '2019-04-30 23:23:22', '食品', '15566378026790001e1cd927b-450c-4856-96d8-519b682618e6.png', '未卖出');
INSERT INTO `db_product` VALUES ('15566378070633f4098dd-19e3-4151-a242-3e569833b7cc0001', '0001', 'aaa', '户外自制数码服装海外代购食品木制家具电器', '1000.00', '人民币', '一成新', '北京市', '2019-04-30 23:23:27', '木制家具', '155663780706200013f4098dd-19e3-4151-a242-3e569833b7cc.png', '未卖出');
INSERT INTO `db_product` VALUES ('155663781244697bdc808-1593-4d9c-97ee-860dda49d4340001', '0001', 'aaa', '户外自制数码服装海外代购食品木制家具电器', '1000.00', '人民币', '一成新', '北京市', '2019-04-30 23:23:32', '电器', '1556637812446000197bdc808-1593-4d9c-97ee-860dda49d434.png', '未卖出');
INSERT INTO `db_product` VALUES ('15566378234159459b041-cbb1-4625-8729-d0b9200df5560001', '0001', 'aaa', '户外自制数码服装海外代购食品木制家具电器', '1000.00', '美元', '一成新', '北京市', '2019-04-30 23:23:43', '户外', '155663782338400019459b041-cbb1-4625-8729-d0b9200df556.png', '未卖出');
INSERT INTO `db_product` VALUES ('1556637836653cc740591-2f88-4ead-9591-a663cd8761b20001', '0001', 'aaa', '户外自制数码服装海外代购食品木制家具电器', '1000.00', '美元', '六成新', '河北省', '2019-04-30 23:23:56', '服装', '15566378366520001cc740591-2f88-4ead-9591-a663cd8761b2.png', '未卖出');
INSERT INTO `db_product` VALUES ('1556637843326cd40ae0e-c9fe-415e-8e46-f530b564b9490001', '0001', 'aaa', '户外自制数码服装海外代购食品木制家具电器', '1000.00', '人民币', '一成新', '北京市', '2019-04-30 23:24:03', '数码', '15566378433250001cd40ae0e-c9fe-415e-8e46-f530b564b949.png', '未卖出');
INSERT INTO `db_product` VALUES ('15566378565556792994e-cdfd-4010-a783-aa9d252642e40001', '0001', 'aaa', '户外自制数码服装海外代购食品木制家具电器', '1000.00', '人民币', '一成新', '北京市', '2019-04-30 23:24:16', '自制', '155663785648600016792994e-cdfd-4010-a783-aa9d252642e4.png', '未卖出');
INSERT INTO `db_product` VALUES ('15568190010889c161e7a-5c07-400e-b6b7-31e82e9574890001', '0001', '海外代购', '海外代购好货好东西好好好', '500.00', '人民币', '一成新', '北京市', '2019-05-03 01:43:21', '海外代购', '155681900108700019c161e7a-5c07-400e-b6b7-31e82e957489.png', '未卖出');
INSERT INTO `db_product` VALUES ('1556819009171a0a24086-f111-49d3-afb6-67ca43a8a9450001', '0001', '海外代购', '海外代购好货好东西好好好', '600.00', '人民币', '一成新', '北京市', '2019-05-03 01:43:29', '海外代购', '15568190091710001a0a24086-f111-49d3-afb6-67ca43a8a945.png', '未卖出');
INSERT INTO `db_product` VALUES ('1556819018726ab4c7a76-511b-44d0-aedd-655741a8fcd70001', '0001', '海外代购', '海外代购好货好东西好好好', '700.00', '人民币', '一成新', '山东省', '2019-05-03 01:43:38', '海外代购', '15568190187250001ab4c7a76-511b-44d0-aedd-655741a8fcd7.png', '未卖出');
INSERT INTO `db_product` VALUES ('1556819026640022b9ec1-59df-4b2b-9664-5df913d06ac40001', '0001', '海外代购', '海外代购好货好东西好好好', '800.00', '人民币', '一成新', '北京市', '2019-05-03 01:43:46', '海外代购', '15568190266400001022b9ec1-59df-4b2b-9664-5df913d06ac4.png', '未卖出');
INSERT INTO `db_product` VALUES ('1556819033370f7d5a7b8-d828-4127-8ee1-8bcc2f479ce90001', '0001', '海外代购', '海外代购好货好东西好好好', '900.00', '人民币', '一成新', '北京市', '2019-05-03 01:43:53', '海外代购', '15568190333690001f7d5a7b8-d828-4127-8ee1-8bcc2f479ce9.png', '未卖出');
INSERT INTO `db_product` VALUES ('15568190422321cafb521-964b-4538-99ff-9856e38617670001', '0001', '海外代购', '海外代购好货好东西好好好', '200.00', '人民币', '一成新', '北京市', '2019-05-03 01:44:02', '海外代购', '155681904223200011cafb521-964b-4538-99ff-9856e3861767.png', '未卖出');
INSERT INTO `db_product` VALUES ('1556819050033cd1fe5b9-3002-4a9d-bbd6-69fdec058d110001', '0001', '海外代购', '海外代购好货好东西好好好', '300.00', '人民币', '一成新', '北京市', '2019-05-03 01:44:10', '海外代购', '15568190500320001cd1fe5b9-3002-4a9d-bbd6-69fdec058d11.png', '未卖出');
INSERT INTO `db_product` VALUES ('1556819063734029ca48f-246d-42f7-8ddd-145a038f74b00001', '0001', '海外代购', '海外代购好货好东西好好好', '100.00', '人民币', '三成新', '河南省', '2019-05-03 01:44:23', '海外代购', '15568190637330001029ca48f-246d-42f7-8ddd-145a038f74b0.png', '未卖出');
INSERT INTO `db_product` VALUES ('15568190743276927c53d-a860-45da-87f3-6026dd8683070001', '0001', '海外代购', '海外代购好货好东西好好好', '600.00', '人民币', '七成新', '河南省', '2019-05-03 01:44:34', '海外代购', '155681907432600016927c53d-a860-45da-87f3-6026dd868307.png', '未卖出');

-- ----------------------------
-- Table structure for db_user
-- ----------------------------
DROP TABLE IF EXISTS `db_user`;
CREATE TABLE `db_user` (
  `ID` varchar(255) NOT NULL,
  `username` varchar(255) NOT NULL,
  `password` varchar(50) NOT NULL,
  `post` varchar(50) NOT NULL COMMENT '会员/管理员',
  `email` varchar(50) NOT NULL,
  `phone` varchar(50) NOT NULL,
  `registertime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' ON UPDATE CURRENT_TIMESTAMP,
  `credit` varchar(50) NOT NULL,
  `turnover` int(255) unsigned DEFAULT NULL,
  `complaint` int(255) unsigned DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `paypassword` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`ID`),
  KEY `username` (`username`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of db_user
-- ----------------------------
INSERT INTO `db_user` VALUES ('0001', 'admin', 'z123456789x', '管理员', '111@qq.com', '12345678911', '2019-05-02 17:43:29', '极好', '0', '0', '天空之城', '123456');
INSERT INTO `db_user` VALUES ('0f1162d9-122f-488a-af30-05a5048e449e1556604657719', 'QQQ', '123456', '会员', '5@QQ.COM', '11111111111', '2019-04-30 14:10:57', '极好', '0', '0', null, null);
INSERT INTO `db_user` VALUES ('8cfe241a-fe2e-4132-8de3-9ccb7640f5c31556554232569', '111', '111111', '会员', '1@qq.com', '11111111111', '2019-04-30 00:10:32', '极好', '0', '0', null, null);
INSERT INTO `db_user` VALUES ('ad28c5b9-b3f2-40c5-a4be-45a07fe13cc91556553934958', 'aaa', '111111', '会员', '1@qq.com', '11111111111', '2019-04-30 00:05:34', '极好', '0', '0', null, null);
INSERT INTO `db_user` VALUES ('cbffd060-e626-4eb1-bdd5-3399760220a71556725091834', 'GGG', '123456789', '会员', '1@qq.com', '11111111111', '2019-05-01 23:38:11', '极好', '0', '0', null, null);
INSERT INTO `db_user` VALUES ('f0afc1da-83aa-4051-9d76-efb23b72f2c21556553969420', 'bbb', '111111', '会员', '1@qq.com', '11111111111', '2019-04-30 00:06:09', '极好', '0', '0', null, null);
